Categories of Joins
--------------------
The pd.merge() function implements a number of types of joins: 

one-to-one,
many-to-one, 
many-to-many joins

- are accessed via pd.merge()

### One-to-one joins

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame(
      {
        'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
        'group': ['Accounting', 'Engineering', 'Engineering', 'HR']
      })

df2 = pd.DataFrame(
    {
     'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
     'hire_date': [2004, 2008, 2012, 2014]
    })

In [5]:
print(df1)
print()
print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

To combine this information into a single DataFrame, use the pd.merge() function

In [4]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

The pd.merge() function recognizes that each DataFrame has an “employee” column,

and automatically joins using this column as a key.

### Many-to-one joins

Many-to-one joins are joins in which one of the two key columns contains duplicate
entries.

In [6]:
df4 = pd.DataFrame(
    {
    'group': ['Accounting', 'Engineering', 'HR'],
    'supervisor': ['Carly', 'Guido', 'Steve']})

print(df3)
print(df4)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [7]:
print(pd.merge(df3, df4))

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

The resulting DataFrame has an additional column with the “supervisor” information,

where the information is repeated in one or more locations as required by the inputs.

### Many-to-many joins

If the key column in both the left and right array contains duplicates, then
the result is a many-to-many merge

In [8]:
df5 = pd.DataFrame(
    {
       'group': ['Accounting', 'Accounting', 'Engineering', 'Engineering', 'HR', 'HR'],
       'skills': ['math', 'spreadsheets', 'coding', 'linux', 'spreadsheets', 'organization']
    } )

print(df1)
print(df5)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [9]:
print(pd.merge(df1, df5))

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [10]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [11]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

### on

In [12]:
print(pd.merge(df1, df2, on='employee'))

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

This option works only if both the left and right DataFrames have the specified column name.

### left_on and right_on

to merge two datasets with different column names

In [13]:
df3 = pd.DataFrame(
    {'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
     'salary': [70000, 80000, 120000, 90000]
    })

print(df1); print(df3);

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [14]:
print(pd.merge(df1, df3, left_on="employee", right_on="name"))

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [15]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name',axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

## Inner Join

In [16]:
df6 = pd.DataFrame(
      {'name': ['Peter', 'Paul', 'Mary'],
       'food': ['fish', 'beans', 'bread']},
        columns=['name', 'food'])

df7 = pd.DataFrame(
    {'name': ['Mary', 'Joseph'],
     'drink': ['wine', 'beer']},
       columns=['name', 'drink'])

print(df6)
print()
print(df7)

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

     name drink
0    Mary  wine
1  Joseph  beer

In [ ]:
print(pd.merge(df6, df7))

the result contains the intersection of the two sets of inputs; known as an inner join.

In [17]:
pd.merge(df6, df7, how='inner')

   name   food drink
0  Mary  bread  wine

## outer join

An outer join returns a join over the union of the input columns, 
 and fills in all missing values with NANs:

In [18]:
print(df6)
print()
print(df7)

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

     name drink
0    Mary  wine
1  Joseph  beer

In [19]:
print(pd.merge(df6, df7, how='outer'))

     name   food drink
0  Joseph    NaN  beer
1    Mary  bread  wine
2    Paul  beans   NaN
3   Peter   fish   NaN

## left join and right join 

return join over the left entries and right entries, respectively

In [ ]:
print(df6)
print()
print(df7)

In [ ]:
pd.merge(df6, df7, how='left')

In [ ]:
print(df6)
print(df7)

In [ ]:
print(pd.merge(df6, df7, how='right'))